#### Day 3: Filtering Data with WHERE Clause 🌟

Today we focus on filtering records using the WHERE clause.

#### 1. Database Connection

In [1]:
import mysql.connector
import pandas as pd

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="30_Days_SQL"
)
cursor = conn.cursor()
print("Connected to '30_Days_SQL'!")

Connected to 'sql_30days_challenge'!

---

#### Practice Exercises 📘

#### 1. Retrieve all employees whose age is less than 30

In [2]:
query = "SELECT * FROM employees WHERE age < 30"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_18364\3640001058.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   id        name  age department  salary
0   2  Jane Smith   25         IT   60000
1   4   Lisa Wong   28         IT   70000

#### 2. Find employees in the Marketing department or aged 35 and above

In [3]:
query = "SELECT * FROM employees WHERE department = 'Marketing' OR age >= 35"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_18364\4292425054.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   id       name  age department  salary
0   3  Sam Brown   35  Marketing   55000
1   5   Mark Lee   32  Marketing   45000

#### 3. Retrieve employees whose names end with the letter 'n'

In [4]:
query = "SELECT * FROM employees WHERE name LIKE '%n'"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_18364\511889890.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   id       name  age department  salary
0   3  Sam Brown   35  Marketing   55000

#### 4. List employees who do not belong to the IT department

In [5]:
query = "SELECT * FROM employees WHERE department != 'IT'"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_18364\1250786248.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   id       name  age department  salary
0   1   John Doe   30         HR   50000
1   3  Sam Brown   35  Marketing   55000
2   5   Mark Lee   32  Marketing   45000

#### 5. Retrieve employees with non-NULL age values

In [6]:
query = "SELECT * FROM employees WHERE age IS NOT NULL"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_18364\4117071628.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   id        name  age department  salary
0   1    John Doe   30         HR   50000
1   2  Jane Smith   25         IT   60000
2   3   Sam Brown   35  Marketing   55000
3   4   Lisa Wong   28         IT   70000
4   5    Mark Lee   32  Marketing   45000

In [7]:
conn.close()